ebook/09.12.05.md

# 9.12.5 PullMessagesRequest

客户端发送一个PullMessagesRequest到CreatePullPointSubscriptionResponse得到对应于一定的订阅通知的端点。下面的示例请求包含一个5秒的超时和限制响应消息总数为2。

```
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
		xmlns:wsa="http://www.w3.org/2005/08/addressing"
		xmlns:tet="http://www.onvif.org/ver10/events/wsdl">
	<SOAP-ENV:Header>
		<wsa:Action>
			http://www.onvif.org/ver10/events/wsdl/PullPointSubscription/PullMessagesRequest
		</wsa:Action>
		<wsa:To>
			http://160.10.64.10/Subscription?Idx=0
		</wsa:To>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<tet:PullMessages>
			<tet:Timeout>
				PT5S
			</tet:Timeout>
			<tet:MessageLimit>
				2
			</tet:MessageLimit>
		</tet:PullMessages>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
```

[上一章](09.12.04.md)|[继续阅读](09.12.06.md)